In [1]:
import numpy as np
import pandas as pd

## Creating a dataframe from Array

## Option 1 From Numpy array

In [9]:
data = np.array([[3, 4], [6, 5], [8, 9]])

In [10]:
df = pd.DataFrame(data, index = ['Row 1', 'Row 2', 'Row 3'], 
                 columns = ['Col 1', 'Col 2'])

In [11]:
df

       Col 1  Col 2
Row 1      3      4
Row 2      6      5
Row 3      8      9

## from List

In [12]:
data = [[3, 4], [6, 5], [8, 9]]

In [13]:
df = pd.DataFrame(data, index = ['Row 1', 'Row 2', 'Row 3'], 
                 columns = ['Col 1', 'Col 2'])

In [14]:
df

       Col 1  Col 2
Row 1      3      4
Row 2      6      5
Row 3      8      9

## From a Dictionay

In [17]:
states = ['California', 'Florida', 'New york', 'Texas']
population = ['39613493', '29730311', '21944577', '19299981']

In [18]:
df_Dict =pd.DataFrame({'States':states,'Population':population})

In [19]:
df_Dict

       States Population
0  California   39613493
1     Florida   29730311
2    New york   21944577
3       Texas   19299981

### From a CSV File

In [20]:
df_exams = pd.read_csv('StudentsPerformance.csv')

In [21]:
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [22]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86